###################################################################

# Created by write_sdc on Mon Jul 8 06:32:24 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -max_library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -min scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -min_library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {valid_lower_gen[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {PIPE_d_K[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Data_Valid[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_Start_Block[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[0][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[0][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[1][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[1][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[2][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[2][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[3][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[3][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[4][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[4][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[5][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[5][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[6][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[6][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[7][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[7][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[8][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[8][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[9][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[9][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[10][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[10][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[11][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[11][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[12][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[12][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[13][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[13][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[14][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[14][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[15][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[15][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[16][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[16][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[17][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[17][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[18][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[18][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[19][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[19][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[20][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[20][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[21][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[21][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[22][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[22][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[23][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[23][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[24][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[24][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[25][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[25][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[26][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[26][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[27][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[27][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[28][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[28][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[29][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[29][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[30][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[30][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[31][0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {RX_SYNC_Header[31][1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_Rcv_Deteted[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[5]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[6]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[7]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[8]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[9]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[10]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[11]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[12]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[13]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[14]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[15]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[16]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[17]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[18]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[19]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[20]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[21]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[22]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[23]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[24]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[25]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[26]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[27]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[28]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[29]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[30]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports {I_RX_EIdle[31]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -pin Y [get_ports I_PhyStatus]
set_load -pin_load 0.5 [get_ports {TxStartBlock[0]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[1]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[2]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[3]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[4]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[5]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[6]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[7]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[8]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[9]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[10]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[11]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[12]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[13]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[14]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[15]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[16]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[17]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[18]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[19]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[20]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[21]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[22]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[23]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[24]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[25]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[26]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[27]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[28]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[29]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[30]}]
set_load -pin_load 0.5 [get_ports {TxStartBlock[31]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[0][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[0][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[1][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[1][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[2][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[2][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[3][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[3][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[4][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[4][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[5][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[5][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[6][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[6][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[7][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[7][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[8][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[8][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[9][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[9][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[10][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[10][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[11][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[11][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[12][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[12][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[13][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[13][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[14][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[14][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[15][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[15][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[16][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[16][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[17][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[17][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[18][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[18][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[19][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[19][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[20][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[20][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[21][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[21][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[22][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[22][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[23][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[23][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[24][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[24][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[25][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[25][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[26][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[26][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[27][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[27][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[28][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[28][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[29][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[29][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[30][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[30][1]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[31][0]}]
set_load -pin_load 0.5 [get_ports {TxSyncHeader[31][1]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[0]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[1]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[2]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[3]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[4]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[5]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[6]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[7]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[8]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[9]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[10]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[11]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[12]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[13]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[14]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[15]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[16]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[17]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[18]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[19]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[20]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[21]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[22]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[23]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[24]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[25]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[26]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[27]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[28]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[29]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[30]}]
set_load -pin_load 0.5 [get_ports {O_St_Detect[31]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[0][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[0][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[1][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[1][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[2][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[2][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[3][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[3][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[4][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[4][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[5][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[5][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[6][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[6][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[7][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[7][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[8][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[8][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[9][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[9][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[10][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[10][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[11][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[11][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[12][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[12][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[13][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[13][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[14][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[14][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[15][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[15][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[16][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[16][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[17][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[17][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[18][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[18][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[19][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[19][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[20][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[20][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[21][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[21][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[22][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[22][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[23][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[23][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[24][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[24][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[25][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[25][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[26][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[26][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[27][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[27][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[28][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[28][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[29][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[29][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[30][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[30][0]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[31][1]}]
set_load -pin_load 0.5 [get_ports {powerDown_PIPE[31][0]}]
set_load -pin_load 0.5 [get_ports {O_rate[2]}]
set_load -pin_load 0.5 [get_ports {O_rate[1]}]
set_load -pin_load 0.5 [get_ports {O_rate[0]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[0]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[1]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[2]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[3]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[4]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[5]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[6]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[7]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[8]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[9]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[10]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[11]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[12]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[13]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[14]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[15]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[16]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[17]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[18]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[19]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[20]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[21]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[22]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[23]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[24]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[25]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[26]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[27]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[28]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[29]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[30]}]
set_load -pin_load 0.5 [get_ports {TxElecIdle_PIPE[31]}]
set_load -pin_load 0.5 [get_ports o_PIPE_rst]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[0]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[1]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[2]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[3]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[4]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[5]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[6]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[7]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[8]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[9]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[10]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[11]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[12]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[13]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[14]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[15]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[16]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[17]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[18]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[19]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[20]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[21]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[22]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[23]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[24]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[25]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[26]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[27]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[28]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[29]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[30]}]
set_load -pin_load 0.5 [get_ports {o_K_PIPE[31]}]
create_clock [get_ports clk]  -period 7  -waveform {0 3}
set_clock_latency 0  [get_clocks clk]
set_clock_uncertainty -setup 0.2  [get_clocks clk]
set_clock_uncertainty -hold 0.1  [get_clocks clk]
set_clock_transition -max -rise 0.05 [get_clocks clk]
set_clock_transition -min -rise 0.05 [get_clocks clk]
set_clock_transition -max -fall 0.05 [get_clocks clk]
set_clock_transition -min -fall 0.05 [get_clocks clk]
set_input_delay -clock clk  1.4  [get_ports rst]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[0]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[1]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[2]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[3]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[4]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[5]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[6]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[7]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[8]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[9]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[10]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[11]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[12]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[13]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[14]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[15]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[16]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[17]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[18]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[19]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[20]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[21]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[22]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[23]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[24]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[25]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[26]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[27]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[28]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[29]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[30]}]
set_input_delay -clock clk  1.4  [get_ports {valid_lower_gen[31]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[0]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[1]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[2]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[3]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[4]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[5]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[6]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[7]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[8]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[9]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[10]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[11]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[12]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[13]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[14]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[15]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[16]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[17]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[18]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[19]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[20]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[21]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[22]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[23]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[24]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[25]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[26]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[27]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[28]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[29]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[30]}]
set_input_delay -clock clk  1.4  [get_ports {PIPE_d_K[31]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[2]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[3]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[4]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[5]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[6]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[7]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[8]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[9]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[10]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[11]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[12]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[13]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[14]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[15]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[16]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[17]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[18]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[19]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[20]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[21]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[22]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[23]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[24]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[25]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[26]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[27]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[28]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[29]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[30]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Data_Valid[31]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[2]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[3]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[4]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[5]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[6]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[7]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[8]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[9]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[10]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[11]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[12]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[13]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[14]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[15]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[16]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[17]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[18]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[19]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[20]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[21]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[22]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[23]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[24]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[25]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[26]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[27]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[28]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[29]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[30]}]
set_input_delay -clock clk  1.4  [get_ports {RX_Start_Block[31]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[0][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[0][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[1][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[1][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[2][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[2][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[3][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[3][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[4][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[4][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[5][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[5][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[6][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[6][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[7][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[7][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[8][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[8][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[9][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[9][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[10][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[10][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[11][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[11][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[12][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[12][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[13][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[13][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[14][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[14][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[15][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[15][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[16][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[16][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[17][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[17][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[18][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[18][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[19][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[19][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[20][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[20][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[21][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[21][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[22][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[22][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[23][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[23][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[24][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[24][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[25][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[25][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[26][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[26][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[27][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[27][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[28][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[28][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[29][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[29][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[30][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[30][1]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[31][0]}]
set_input_delay -clock clk  1.4  [get_ports {RX_SYNC_Header[31][1]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[0]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[1]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[2]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[3]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[4]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[5]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[6]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[7]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[8]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[9]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[10]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[11]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[12]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[13]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[14]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[15]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[16]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[17]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[18]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[19]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[20]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[21]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[22]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[23]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[24]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[25]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[26]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[27]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[28]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[29]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[30]}]
set_input_delay -clock clk  1.4  [get_ports {I_Rcv_Deteted[31]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[0]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[1]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[2]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[3]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[4]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[5]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[6]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[7]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[8]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[9]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[10]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[11]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[12]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[13]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[14]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[15]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[16]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[17]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[18]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[19]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[20]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[21]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[22]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[23]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[24]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[25]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[26]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[27]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[28]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[29]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[30]}]
set_input_delay -clock clk  1.4  [get_ports {I_RX_EIdle[31]}]
set_input_delay -clock clk  1.4  [get_ports I_PhyStatus]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[0]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[1]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[2]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[3]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[4]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[5]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[6]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[7]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[8]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[9]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[10]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[11]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[12]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[13]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[14]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[15]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[16]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[17]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[18]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[19]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[20]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[21]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[22]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[23]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[24]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[25]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[26]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[27]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[28]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[29]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[30]}]
set_output_delay -clock clk  1.4  [get_ports {O_St_Detect[31]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[0]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[1]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[2]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[3]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[4]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[5]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[6]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[7]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[8]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[9]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[10]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[11]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[12]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[13]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[14]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[15]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[16]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[17]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[18]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[19]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[20]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[21]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[22]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[23]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[24]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[25]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[26]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[27]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[28]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[29]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[30]}]
set_output_delay -clock clk  1.4  [get_ports {TxStartBlock[31]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[0][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[0][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[1][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[1][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[2][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[2][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[3][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[3][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[4][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[4][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[5][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[5][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[6][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[6][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[7][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[7][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[8][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[8][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[9][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[9][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[10][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[10][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[11][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[11][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[12][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[12][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[13][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[13][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[14][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[14][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[15][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[15][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[16][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[16][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[17][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[17][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[18][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[18][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[19][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[19][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[20][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[20][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[21][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[21][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[22][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[22][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[23][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[23][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[24][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[24][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[25][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[25][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[26][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[26][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[27][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[27][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[28][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[28][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[29][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[29][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[30][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[30][1]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[31][0]}]
set_output_delay -clock clk  1.4  [get_ports {TxSyncHeader[31][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[0][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[0][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[1][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[1][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[2][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[2][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[3][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[3][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[4][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[4][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[5][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[5][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[6][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[6][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[7][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[7][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[8][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[8][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[9][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[9][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[10][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[10][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[11][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[11][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[12][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[12][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[13][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[13][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[14][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[14][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[15][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[15][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[16][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[16][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[17][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[17][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[18][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[18][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[19][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[19][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[20][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[20][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[21][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[21][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[22][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[22][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[23][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[23][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[24][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[24][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[25][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[25][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[26][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[26][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[27][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[27][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[28][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[28][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[29][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[29][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[30][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[30][0]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[31][1]}]
set_output_delay -clock clk  1.4  [get_ports {powerDown_PIPE[31][0]}]
set_output_delay -clock clk  1.4  [get_ports {O_rate[2]}]
set_output_delay -clock clk  1.4  [get_ports {O_rate[1]}]
set_output_delay -clock clk  1.4  [get_ports {O_rate[0]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[0]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[1]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[2]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[3]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[4]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[5]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[6]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[7]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[8]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[9]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[10]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[11]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[12]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[13]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[14]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[15]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[16]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[17]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[18]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[19]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[20]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[21]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[22]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[23]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[24]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[25]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[26]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[27]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[28]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[29]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[30]}]
set_output_delay -clock clk  1.4  [get_ports {TxElecIdle_PIPE[31]}]
set_output_delay -clock clk  1.4  [get_ports o_PIPE_rst]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[0]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[1]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[2]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[3]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[4]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[5]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[6]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[7]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[8]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[9]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[10]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[11]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[12]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[13]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[14]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[15]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[16]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[17]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[18]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[19]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[20]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[21]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[22]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[23]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[24]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[25]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[26]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[27]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[28]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[29]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[30]}]
set_output_delay -clock clk  1.4  [get_ports {o_K_PIPE[31]}]
